src/BusinessProcesses/амбДокументооборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<BusinessProcess>
		<Properties>
			<Name>амбДокументооборот</Name>
			<Task>Task.амбЗадачиПользователя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКопийПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/Enums/амбВидыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>амбВидыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распечатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/BusinessProcesses/амбДокументооборот/Ext/ObjectModule.bsl
Процедура УсловиеПечатиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СогласованиеМенеджеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекЗадача из ФормируемыеЗадачи Цикл
		ТекЗадача.Исполнитель = Счет.Ответственный;
		ТекЗадача.Счет   =Счет;
		ТекЗадача.Реализация = Реализация;
		ТекЗадача.ВидЗадачи = Перечисления.амбВидыЗадач.Согласование;
		ТекЗадача.КоличествоКопийПечати = КоличествоКопийПечати;
		ТекЗадача.Расписка = Расписка; 
	КонецЦикла;                                 
КонецПроцедуры

Процедура СогласованиеМенеджеромПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
 
КонецПроцедуры

Процедура Действие1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого ТекЗадача из ФормируемыеЗадачи Цикл
		
		ТекЗадача.Исполнитель = Константы.амбБухгалтерСклада.Получить();
		ТекЗадача.Счет   =Счет;
		ТекЗадача.Реализация = Реализация;
		ТекЗадача.ВидЗадачи = Перечисления.амбВидыЗадач.Распечатка;
		ТекЗадача.КоличествоКопийПечати = КоличествоКопийПечати;
		ТекЗадача.Расписка = Расписка;

	КонецЦикла;
КонецПроцедуры


Процедура СогласованиеМенеджеромПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Сообщить("Задача отправлена на склад!!!");
	КоличествоКопийПечати = Задача.КоличествоКопийПечати;
	Расписка = Задача.Расписка;
КонецПроцедуры

Процедура Действие2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	    Администратор = Константы.амбАдминистратор.Получить();
		Для каждого ТекЗадача из ФормируемыеЗадачи Цикл
		ТекЗадача.Исполнитель = Администратор;
		ТекЗадача.Счет   =Счет;
		ТекЗадача.Реализация = Реализация;
		ТекЗадача.ВидЗадачи = Перечисления.амбВидыЗадач.Согласование;
		ТекЗадача.КоличествоКопийПечати = 1;
		ТекЗадача.Расписка = Расписка;
        
		Если не ТекЗадача.Реализация.Контрагент = Константы.НовыйРубеж.Получить()  тогда					
			
			ТекЗадача.ВыполнитьЗадачу();
			
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры
